[
    {
        "date": "2025-07-01 08:45:12",
        "title": "Ticket Surge Tuesday",
        "content": "Handled a sudden surge in support tickets today. Mostly internet downtime reports from clients in VI. Took Dhuhr break on time, Alhamdulillah."
    },
    {
        "date": "2025-07-02 19:10:30",
        "title": "Email Server Bug",
        "content": "Spent most of the day debugging an email server misconfiguration. Finally resolved it by checking MX records. Grateful I could still make Maghrib at the mosque."
    },
    {
        "date": "2025-07-03 07:58:11",
        "title": "Early Start",
        "content": "Logged in earlier than usual. Cleared out backlog before the daily standup. Jumu'ah prep tomorrow—need to pick a clean thobe."
    },
    {
        "date": "2025-07-04 18:32:50",
        "title": "Jumu'ah Reflections",
        "content": "Went for Jumu'ah at the Central Mosque in Lagos Island. The khutbah was about patience in hardship. Really resonated after this stressful week."
    },
    {
        "date": "2025-07-05 14:20:15",
        "title": "Madrasah Lessons",
        "content": "Weekend madrasah was refreshing. Revised Surah Al-Mulk and learned some Hadith on intention. Did laundry afterwards and cleaned the kitchen."
    },
    {
        "date": "2025-07-06 15:45:09",
        "title": "Sunday Routine",
        "content": "Attended morning class at madrasah. Discussed tafsir of Surah Qalam. After that, helped mom with the shopping and swept the compound."
    },
    {
        "date": "2025-07-07 17:50:40",
        "title": "VPN Issues at Work",
        "content": "Dealt with VPN access problems for remote employees. Resolved via DNS flushing and cert renewal. Missed Asr, had to pray Qadha. Need to plan better."
    },
    {
        "date": "2025-07-08 19:05:02",
        "title": "Good Feedback",
        "content": "Got positive feedback from the manager on ticket resolution time. Feels good. Treated myself to suya and zobo for dinner."
    },
    {
        "date": "2025-07-09 20:00:00",
        "title": "Cable Chaos",
        "content": "Had to manually re-cable the server rack—sweated buckets. Skipped lunch. Took time after work to recite some Qur’an and unwind."
    },
    {
        "date": "2025-07-10 06:45:55",
        "title": "Qur’an Before Work",
        "content": "Woke up earlier than usual. Prayed Fajr and read Surah Rahman before starting work. It really set the tone for the day."
    },
    {
        "date": "2025-07-11 18:14:33",
        "title": "Power Outage Struggles",
        "content": "NEPA did their thing again. Switched to inverter and hotspot to stay online. Still closed all tickets. Alhamdulillah for resilience."
    },
    {
        "date": "2025-07-12 13:30:00",
        "title": "Madrasah Quiz",
        "content": "Had a fiqh quiz at madrasah today—did pretty well. Grateful for the ustadh’s detailed teaching. Swept and mopped the house afterwards."
    },
    {
        "date": "2025-07-13 14:45:19",
        "title": "Spiritual Sunday",
        "content": "Madrasah focused on the Seerah today—particularly the Battle of Badr. Always moving to hear it. Also fixed the kitchen tap after class."
    },
    {
        "date": "2025-07-14 20:50:10",
        "title": "Slack Notification Flood",
        "content": "Slack didn’t stop buzzing all day. Coordinated issue triage between teams. It’s tough staying productive but Alhamdulillah, I managed."
    },
    {
        "date": "2025-07-15 17:15:23",
        "title": "Career Thoughts",
        "content": "Had a long think about whether to specialize in cybersecurity. Made istikhara about it. Let’s see where Allah guides me."
    },
    {
        "date": "2025-07-16 18:48:55",
        "title": "Patience Tested",
        "content": "A very rude client today tested my patience. Recited Surah Al-Asr silently and kept my calm. Proud of myself."
    },
    {
        "date": "2025-07-17 19:25:07",
        "title": "System Downtime Firefight",
        "content": "Emergency: system outage affecting over 100 users. Was on it for hours. Resolved by 6 PM. Took time to decompress after Isha."
    },
    {
        "date": "2025-07-18 20:10:00",
        "title": "Simple Jumu’ah",
        "content": "Went to local masjid for Jumu’ah. Peaceful and quiet. The Imam’s reminder on accountability stayed with me through the day."
    },
    {
        "date": "2025-07-19 13:00:30",
        "title": "Busy Saturday",
        "content": "Cleaned the bathroom, did laundry, and still made it to madrasah. Learned about zakat distribution rules. Productive day."
    },
    {
        "date": "2025-07-20 15:35:40",
        "title": "Weekend Wrap-Up",
        "content": "Final madrasah session for the month. Studied Arabic grammar basics. Cooked jollof rice after class while listening to an Islamic podcast."
    },
    {
        "date": "2025-07-05 08:34:31",
        "title": "Going to Madrasah",
        "content": "I missed going to Madrasah today due to code writing."
    }
]